trunk/app/controllers/albums_controller.rb

  def show
    @album = Album.find(params[:id])
---
SELECT * FROM `albums` WHERE (`albums`.`id` = 157)