trunk/app/controllers/artists_controller.rb

  def index
    if (params[:l].nil?)
      # TODO przeniesc zmienicapytanie wyszukujace do modelu, i zmienic tu na Artist.search
      @artists = Artist.all(:order => 'created_at desc', :conditions => ['image_file_name <> ""'], :limit => 20)
---
SELECT * FROM `artists` WHERE (ucase(left(name, 1)) = 'ę') ORDER BY name

  def show
    @artist = Artist.find(params[:id])

    # pobieram lista albumow, wydanych przez grupy, do ktorych należy dany wykonawca - czy dobrze to robię?
    @group_albums = Album.group_albums(@artist.bands)
---
SELECT * FROM `artists` WHERE (`artists`.`id` = 635)
SELECT * FROM `albums` WHERE (artist_id in(34)) ORDER BY release_date