trunk/app/controllers/labels_controller.rb

SELECT * FROM `labels` WHERE (ucase(left(name, 1)) = 'b')
---
  def index
    if (params[:l].nil?)
      @labels = Label.all(:order => 'name', :conditions => ['image_file_name <> ""'])