app/controllers/songs_controller.rb

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM `songs` WHERE (`songs`.`id` = 2077)